Repository: ahkcn/AutoHotKey_L
Catalog: AutoHotkey_L-版本.OmegaT/AutoHotkey_L-版本.OmegaT-level1.tmx
Source language: en_us
Languages: zh_cn

source: Added syntax for defining dynamic [url=http://ahkscript.org/docs/Objects.htm#Custom_Classes_property]properties[/url] in classes.
zh_cn: 支持在类中动态定义[url=http://ahkscript.org/docs/Objects.htm#Custom_Classes_property]属性[/url]（英文）。

source: Added the #InputLevel of each hotkey to ListHotkeys (when non-zero).
zh_cn: 为ListHotkeys（列出热键）中每个热键增加#InputLevel项。

source: Added x+m and y+m options for Gui control positioning.
zh_cn: 为Gui控件定位增加x+m与y+m选项。

source: An error message is now shown instead.
zh_cn: 修正后会提示错误信息。

source: Fixed #If to add itself to ListLines (though as "If").
zh_cn: 修复#If，将它自己添加到ListLines中（将显示为If）。

source: Fixed A_LineFile/A_LineNumber in #If expressions.
zh_cn: 修复A_LineFile / A_LineNumber在#If表达式中（无法正确返回设计值）的问题。

source: Fixed Clipboard returning binary CF_HDROP data in some instances.
zh_cn: 修复某些情况Clipboard会保留了CF_HDROP二进制数据的问题。

source: Fixed File.Encoding := x "-RAW" breaking encoding/decoding of non-ASCII characters.
zh_cn: 修正错误，File.Encoding := x "-RAW"打断对非ASCII字符的编码/解码。

source: Fixed FileRead *c to null-terminate correctly when byte length is odd.
zh_cn: 修复FileRead *c，使当字节长度为奇数时，亦能正确的放置空结尾字符。

source: Fixed FileRead to correctly report an error with files over 4GB, instead of truncating even when it wasn't requested.
zh_cn: 修复FileRead，使正确报告文件超4GB时的错误，而非截断数据，即便不需要这部分数据时。

source: Fixed [c]Abs(["-"]*)[/c] and similar crashing the program.
zh_cn: 修复[c]Abs(["-"]*)[/c]及类似情况下的崩溃问题。

source: Fixed [c]} funcdef(){[/c] globally and [c]}}[/c] ending a method/property/class.
zh_cn: 修复全局中[c]} funcdef(){[/c]及[c]}}[/c]结尾的方法/属性/类。（？）

source: Fixed a performance issue with &var_containing_long_string_of_digits.
zh_cn: 修正性能问题：变量名为长数值字符串。

source: Fixed a possible ListView/TreeView message filtering issue.
zh_cn: 修复ListView/TreeView消息筛选中可能的问题。

source: Fixed built-in variables corrupting memory when an object is assigned.
zh_cn: 修正问题：当内置变量被赋值为对象时，会破坏内存数据。

source: Fixed objects to check for new methods after __Call completes (consistent with __Set and __Get).
zh_cn: 修复对象，当__Call结束时将检测新方法（同__Set及__Get一致）。

source: Fixed parser to allow #include inside a class (broken by v1.1.16.01).
zh_cn: 修复解析器，以允许在类中#include（于v1.1.16.01时破坏）。

source: Fixed parser to disallow continue where appropriate even if the current function is defined inside a Loop.
zh_cn: 修正代码解析错误，以禁止某些代码中的continue命令，即便此命令在Loop内。

source: Fixed some ClipboardAll issues and changed behaviour: [list][*][url=http://ahkscript.org/docs/commands/_ClipboardTimeout.htm]#ClipboardTimeout[/url] is ignored for GetClipboardData(), since it never actually worked and it caused problems.
zh_cn: 修复ClipboardAll的问题，作如下改变：[list][*][url=http://ahkscript.org/docs/commands/_ClipboardTimeout.htm]#ClipboardTimeout[/url]（英文）被GetClipboardData()忽略，之前它也并未实际发挥作用却导致问题。

source: Fixed some bad behaviour in Abs() and Mod() caused by a broken bug-fix in v1.1.16.01.
zh_cn: 修复Abs()及Mod()的一些错误的行为，于v1.1.16.01引入的错误的修复。

source: Fixed some undefined behaviour occurring after VarSetCapacity fails.
zh_cn: 修复一些VarSetCapacity失败后的未定义行为。

source: Improved accuracy of FileGetSize on files which are still open.
zh_cn: 提升FileGetSize作用于打开文件时的精度。

source: Improved for-loop to work with COM objects which either don't resolve the name "_NewEnum" to DISPID_NEWENUM, or which implement _NewEnum as a property rather than a method.
zh_cn: 提升for-loop，可用于不解析_NemNnum为DISPID_NEWENUM，或者把_NewEnum做为属性（而非方法）的那些COM对象。

source: Optimized RegExMatch with the O (object) option; capturing part of a long string is much faster than before in some cases.
zh_cn: 优化待O（对象）选项的RegExMatch（正则查找）。某些情况下，捕获长字符串较之前有极大提速。

source: See File.Encoding for details (including some that were previously undocumented).
zh_cn: 细节参见File.Encoding（包含之前文档的遗漏新信息）。

source: The -RAW suffix is now ignored.
zh_cn: -RAW后缀被略过。

source: This fixes timeouts and lost data when a file is on the clipboard (any file on Windows 8, or any file in a zip file or similar).
zh_cn: 本修复解决剪切板为文件时（Windows 8中的任何文件，及zip或类似东西中的文件），超时及丢失数据的问题。

source: This increases the reported StrLen by 1, potentially avoiding truncation of the last byte.[/list] Fixed A_EventInfo for TreeView items with negative screen coords.
zh_cn: 则由StrLen返回的结果可能被加1，避免可能对最后一个字节的截断。[/list]修复带负屏幕坐标值的TreeView控件的A_EventInfo值。

source: [*]ClipboardAll and FileRead *c on Unicode builds now round length up when odd.
zh_cn: [*]Unicode版本中当ClipboardAll及FileRead *c数据长度为奇数时，将向上取整到最近的偶数。

source: [*]The presence of MSDEVColumnSelect/MSDEVLineSelect is now preserved when set by Scintilla, though any data set by VS is discarded.
zh_cn: [*]由Scintilla设置的MSDEVColumnSelect / MSDEVLineSelec将被保持，但由VS设置的任何数据将被丢弃。

source: [*]When writing ClipboardAll directly to file, it now prefers Unicode (other usages of ClipboardAll have had this behaviour since v1.1.08).
zh_cn: [*]当直接将ClipboardAll写至文件时，将优先使用Unicode（ClipboardAll的其他使用情况自v1.1.08起便如此）。

source: [*]Zero-length clipboard items are allocated 1 byte upon restoring to the clipboard, since setting a zero-length item seems to always fail.
zh_cn: [*]为零长度剪切板内容分配1字节再返还给剪切板，之前设置为零长度似乎有问题。

source: [b][size=150][url=http://ahkscript.org/download/]Downloads[/url][/size][/b][/quote]
zh_cn: [b][size=150][url=http://ahkscript.org/download/]下载[/url][/size][/b][/quote]

source: [url=http://ahkscript.org/boards/viewtopic.php?f=24&t=4519]v1.1.16 - Properties, bug fixes and optimizations[/url]
zh_cn: [url=http://ahkscript.org/boards/viewtopic.php?f=24&t=4519]v1.1.16 - 属性，Bug修复，优化[/url]
